/*
 Navicat Premium Data Transfer

 Source Server         : 本机
 Source Server Type    : MySQL
 Source Server Version : 80027
 Source Host           : localhost:3306
 Source Schema         : blog

 Target Server Type    : MySQL
 Target Server Version : 80027
 File Encoding         : 65001

 Date: 19/08/2022 23:32:17
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for advertisement
-- ----------------------------
DROP TABLE IF EXISTS `advertisement`;
CREATE TABLE `advertisement`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `position` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '在那个页面的推广',
  `indexes` int NOT NULL COMMENT '排序索引值',
  `poster_file_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '海报文件名称',
  `url` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '活动地址',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = MyISAM AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '广告投放' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of advertisement
-- ----------------------------
INSERT INTO `advertisement` VALUES (442889150110, 'all', 1, 'b9def25de24d469bb8fa1eb33ecb2e07.webp', NULL, '2022-08-19 14:14:51');

-- ----------------------------
-- Table structure for article
-- ----------------------------
DROP TABLE IF EXISTS `article`;
CREATE TABLE `article`  (
  `id` bigint NOT NULL COMMENT '文章ID',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章标题',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '文章介绍',
  `tag` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章标签',
  `author` bigint NOT NULL COMMENT '发布者ID',
  `content` mediumtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章内容',
  `cover_file_name` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '封面图片名称',
  `reprint` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '转载地址，原创为null',
  `state` int NOT NULL COMMENT '文章状态',
  `view_count` int NOT NULL DEFAULT 0 COMMENT '阅读次数',
  `update_time` datetime NULL DEFAULT NULL COMMENT '最近一次更新的时间',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '文章表' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of article
-- ----------------------------
INSERT INTO `article` VALUES (443116533810, '形四感得很开受', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', NULL, NULL, 1, 0, NULL, '2022-08-19 14:52:45');
INSERT INTO `article` VALUES (443159470210, '形四感得很开受', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', NULL, NULL, 1, 0, NULL, '2022-08-19 14:59:54');
INSERT INTO `article` VALUES (444402104710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:01');
INSERT INTO `article` VALUES (444402214910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:02');
INSERT INTO `article` VALUES (444402252110, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:02');
INSERT INTO `article` VALUES (444402302710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 0, 0, NULL, '2022-08-19 18:27:03');
INSERT INTO `article` VALUES (444402340010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:03');
INSERT INTO `article` VALUES (444402373210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:03');
INSERT INTO `article` VALUES (444402407610, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:04');
INSERT INTO `article` VALUES (444402441210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:04');
INSERT INTO `article` VALUES (444402474310, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:04');
INSERT INTO `article` VALUES (444402503310, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:27:05');
INSERT INTO `article` VALUES (444592371510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:43');
INSERT INTO `article` VALUES (444592412210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:44');
INSERT INTO `article` VALUES (444592465510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:44');
INSERT INTO `article` VALUES (444592501410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:45');
INSERT INTO `article` VALUES (444592532910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:45');
INSERT INTO `article` VALUES (444592566510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:45');
INSERT INTO `article` VALUES (444592598810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:45');
INSERT INTO `article` VALUES (444592634710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:46');
INSERT INTO `article` VALUES (444592670510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:46');
INSERT INTO `article` VALUES (444592700210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:47');
INSERT INTO `article` VALUES (444592734810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:47');
INSERT INTO `article` VALUES (444592785010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:47');
INSERT INTO `article` VALUES (444592822710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:48');
INSERT INTO `article` VALUES (444592863410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:48');
INSERT INTO `article` VALUES (444592902410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:49');
INSERT INTO `article` VALUES (444592946910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:49');
INSERT INTO `article` VALUES (444592982410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:49');
INSERT INTO `article` VALUES (444593021510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:50');
INSERT INTO `article` VALUES (444593060910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:50');
INSERT INTO `article` VALUES (444593096510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:50');
INSERT INTO `article` VALUES (444593118810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:51');
INSERT INTO `article` VALUES (444593155910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:51');
INSERT INTO `article` VALUES (444593190010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:51');
INSERT INTO `article` VALUES (444593224710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:52');
INSERT INTO `article` VALUES (444593261010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:52');
INSERT INTO `article` VALUES (444593293710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:52');
INSERT INTO `article` VALUES (444593328210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:53');
INSERT INTO `article` VALUES (444593539010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:55');
INSERT INTO `article` VALUES (444593585710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:55');
INSERT INTO `article` VALUES (444593615310, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:56');
INSERT INTO `article` VALUES (444593651810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:56');
INSERT INTO `article` VALUES (444593697010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:56');
INSERT INTO `article` VALUES (444593728410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:58:57');
INSERT INTO `article` VALUES (444595525910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:15');
INSERT INTO `article` VALUES (444595567310, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:15');
INSERT INTO `article` VALUES (444595629510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:16');
INSERT INTO `article` VALUES (444595659910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:16');
INSERT INTO `article` VALUES (444595685510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:16');
INSERT INTO `article` VALUES (444595718810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:17');
INSERT INTO `article` VALUES (444595759210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:17');
INSERT INTO `article` VALUES (444595800010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:18');
INSERT INTO `article` VALUES (444595836110, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:18');
INSERT INTO `article` VALUES (444595872410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:18');
INSERT INTO `article` VALUES (444595906210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:19');
INSERT INTO `article` VALUES (444595946510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:19');
INSERT INTO `article` VALUES (444595984010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:19');
INSERT INTO `article` VALUES (444596125810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:21');
INSERT INTO `article` VALUES (444596165010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:21');
INSERT INTO `article` VALUES (444596203810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:22');
INSERT INTO `article` VALUES (444596242910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:22');
INSERT INTO `article` VALUES (444596283710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:22');
INSERT INTO `article` VALUES (444596319610, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:23');
INSERT INTO `article` VALUES (444596356110, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:23');
INSERT INTO `article` VALUES (444596393910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:23');
INSERT INTO `article` VALUES (444596432210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:24');
INSERT INTO `article` VALUES (444596468510, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:24');
INSERT INTO `article` VALUES (444596510610, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:25');
INSERT INTO `article` VALUES (444596549410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:25');
INSERT INTO `article` VALUES (444596590210, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:25');
INSERT INTO `article` VALUES (444596632710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:26');
INSERT INTO `article` VALUES (444596673710, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:26');
INSERT INTO `article` VALUES (444596712010, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:27');
INSERT INTO `article` VALUES (444596752410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:27');
INSERT INTO `article` VALUES (444596792910, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:27');
INSERT INTO `article` VALUES (444596828410, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:28');
INSERT INTO `article` VALUES (444596865810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:28');
INSERT INTO `article` VALUES (444596901810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '<p>正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。</p>\n', '687a48650cea43c791059fd38e99b9f2.webp', NULL, 1, 0, '2022-08-19 21:03:57', '2022-08-19 18:59:29');
INSERT INTO `article` VALUES (444596925810, 'null', '效身意阶形较完总段进力农象北工划白。始水拉将音话接管要到建被都集联热正。半持毛热点水状传酸从老历情求但须。值关几收适习造斗行于属却。才系只油时类高实料八具般。', '281632130010', 1, '正组前任面自但厂电多广论。把我圆研见土以越不明场北三列以导。存文自中何压战干准省京成受己。前且车展上交处民老断给响料应正收次到。支石当习切说第们当军用给照。影市少七更必改标米龙发除山受斗。', '213908129038.webp', NULL, 1, 0, NULL, '2022-08-19 18:59:29');
INSERT INTO `article` VALUES (444736571510, '213', NULL, '', 1, '<p>2111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111211111111111111111111111111111121111111111111111111111111111112111111111111111111111111111111</p>\n', NULL, NULL, 0, 1, NULL, '2022-08-19 19:22:45');
INSERT INTO `article` VALUES (444771061510, '少时诵诗书所所所所所所所所所', NULL, '272809693910,281633270110', 1, '<p>少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所少时诵诗书所所所所所所所所所</p>\n', NULL, NULL, 1, 0, NULL, '2022-08-19 19:28:30');
INSERT INTO `article` VALUES (445348189210, '测试测', NULL, '', 1, '<p>测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测</p>\n', NULL, NULL, 0, 2, '2022-08-19 23:23:11', '2022-08-19 21:04:41');
INSERT INTO `article` VALUES (445356490510, '测试', '水水水水水水水水水水水水水水水水水水', '272809693910,281633270110', 1, '<p>测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测测试测</p>\n', '1a67e84da4144db4afcf6bc050301a46.webp', 'https://juejin.cn/creator/content/article/drafts', 1, 1, '2022-08-19 22:18:07', '2022-08-19 21:06:04');
INSERT INTO `article` VALUES (446201830310, '1222222', NULL, '272809693910,281633270110', 1, '<p>21111111111111</p>\n', NULL, NULL, 1, 0, NULL, '2022-08-19 23:26:58');
INSERT INTO `article` VALUES (446230467410, '11111111111111111111111111111111111111111111111111', NULL, '', 1, '<p>111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111</p>\n', NULL, NULL, 0, 0, NULL, '2022-08-19 23:31:44');

-- ----------------------------
-- Table structure for collection
-- ----------------------------
DROP TABLE IF EXISTS `collection`;
CREATE TABLE `collection`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `article_id` bigint NOT NULL COMMENT '文章ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `time` datetime NOT NULL COMMENT '收藏时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '收藏表' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of collection
-- ----------------------------

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `article_id` bigint NOT NULL COMMENT '文章ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '内容',
  `reply` bigint NULL DEFAULT NULL COMMENT '是否是对某个评论的回复，不是则为null是则为对应的评论id',
  `client_ip` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户IP',
  `comment_pics` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '评论中使用到的图片',
  `create_time` datetime NOT NULL COMMENT '评论时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '评论表' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of comment
-- ----------------------------

-- ----------------------------
-- Table structure for follow
-- ----------------------------
DROP TABLE IF EXISTS `follow`;
CREATE TABLE `follow`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `blogger_id` bigint NOT NULL COMMENT '被关注者的ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `time` datetime NOT NULL COMMENT '关注时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '关注表' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of follow
-- ----------------------------
INSERT INTO `follow` VALUES (366502051510, 1, 1, '2022-08-10 18:03:40');

-- ----------------------------
-- Table structure for notice
-- ----------------------------
DROP TABLE IF EXISTS `notice`;
CREATE TABLE `notice`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `content` mediumtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '内容',
  `title` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '标题',
  `isRead` tinyint(1) NOT NULL COMMENT '已读',
  `time` datetime NOT NULL COMMENT '发送时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '站内提示信息存储' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of notice
-- ----------------------------

-- ----------------------------
-- Table structure for tag
-- ----------------------------
DROP TABLE IF EXISTS `tag`;
CREATE TABLE `tag`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'tag名称',
  `belong` bigint NOT NULL COMMENT '所属Type的ID',
  `icon_file_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'ICON文件名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `indexes` int NOT NULL COMMENT '索引值',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `name`(`name` ASC) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Compact;

-- ----------------------------
-- Records of tag
-- ----------------------------
INSERT INTO `tag` VALUES (272809693910, '321', 264563342910, NULL, '2022-07-30 21:48:16', 2);
INSERT INTO `tag` VALUES (281632130010, '阿斯顿发', 264563342910, 'e3fd40fb96ed434eac43e406a5ce2476.webp', '2022-07-31 22:18:41', 0);
INSERT INTO `tag` VALUES (281633270110, '森岛帆高', 264563342910, 'cb8a72d4ac7640bf9b7c5ddb9b7333c5.webp', '2022-07-31 22:18:52', 3);
INSERT INTO `tag` VALUES (281634969610, '阿斯顿发啊', 264563342910, NULL, '2022-07-31 22:19:09', 4);
INSERT INTO `tag` VALUES (281635673010, '森岛帆高第三方个森岛帆高的', 281634314910, NULL, '2022-07-31 22:19:16', 1);
INSERT INTO `tag` VALUES (281637246810, '的双方各第三方地方', 281634314910, 'b49dc32bc4444f7fa7a4747fb2216259.webp', '2022-07-31 22:19:32', 0);
INSERT INTO `tag` VALUES (385626967810, '123123', 385329225510, NULL, '2022-08-12 23:11:09', 1);
INSERT INTO `tag` VALUES (385627505510, '123123123', 385329225510, NULL, '2022-08-12 23:11:15', 2);

-- ----------------------------
-- Table structure for tips_set
-- ----------------------------
DROP TABLE IF EXISTS `tips_set`;
CREATE TABLE `tips_set`  (
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `follow` tinyint(1) NULL DEFAULT NULL COMMENT '关注的用户有新文章',
  `comment` tinyint(1) NULL DEFAULT NULL COMMENT '收到回复',
  `follow_me` tinyint(1) NULL DEFAULT NULL COMMENT '有人关注我',
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户消息推送设置' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of tips_set
-- ----------------------------

-- ----------------------------
-- Table structure for type
-- ----------------------------
DROP TABLE IF EXISTS `type`;
CREATE TABLE `type`  (
  `id` bigint NOT NULL COMMENT 'ID',
  `name` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '类型/标签 名字',
  `indexes` int NOT NULL COMMENT '排序、索引',
  `icon_file_name` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'ICON文件名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '介绍用于meta中description',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `name`(`name` ASC) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '网站文章的类型与标签' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of type
-- ----------------------------
INSERT INTO `type` VALUES (264563342910, '213', 2, NULL, '2022-07-29 22:53:53', 'asdsadasdasdasd');
INSERT INTO `type` VALUES (281634314910, '阿斯顿发', 2, '248d7eb026de42c683bb743e34fa148a.webp', '2022-07-31 22:19:03', '阿数据库的话卡卷红烧豆腐框架爱是可点击好');
INSERT INTO `type` VALUES (281638090010, '空的', 3, NULL, '2022-07-31 22:19:40', '空的空的空的空的空的空的空的空的空的空的空的');
INSERT INTO `type` VALUES (385328797410, '阿斯顿撒多撒', 4, '776ce49bbdbb4abf8e494301c81e1307.webp', '2022-08-12 22:21:27', '阿斯顿撒多撒');
INSERT INTO `type` VALUES (385329225510, '阿斯顿发送到', 5, NULL, '2022-08-12 22:21:32', '阿斯顿发斯蒂芬');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` bigint NOT NULL COMMENT '用户ID',
  `name` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '昵称',
  `auth` int NOT NULL COMMENT '身份',
  `email` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '用户邮箱',
  `github` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'GitHub ID',
  `qq` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'QQ号',
  `password` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '密码',
  `state` int NOT NULL DEFAULT 1 COMMENT '状态，（权限）',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '自我介绍',
  `site` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '个人网站',
  `unit` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '所属单位',
  `location` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '所在地区',
  `avatar_file_name` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '头像图片名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `email`(`email` ASC) USING BTREE,
  UNIQUE INDEX `github`(`github` ASC) USING BTREE,
  UNIQUE INDEX `qq`(`qq` ASC) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户数据表' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'admin1', 1, '1974109227@qq.com', 'Lrunlin', '1974109227', '1974109227', 1, NULL, NULL, NULL, NULL, 'default.webp', '2022-07-10 00:00:00');
INSERT INTO `user` VALUES (247111576410, '1', 0, '353575900@qq.com', NULL, NULL, '11111111', 1, '低调的站长', NULL, NULL, NULL, 'default.webp', '2022-07-27 22:25:15');

SET FOREIGN_KEY_CHECKS = 1;
