-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1:3306
-- 生成日期： 2022-08-17 10:10:35
-- 服务器版本： 8.0.27
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `blog`
--

-- --------------------------------------------------------

--
-- 表的结构 `advertisement`
--

DROP TABLE IF EXISTS `advertisement`;
CREATE TABLE IF NOT EXISTS `advertisement` (
  `id` bigint NOT NULL COMMENT 'ID',
  `position` varchar(100) COLLATE utf8mb4_general_ci NOT NULL COMMENT '在那个页面的推广',
  `indexes` int NOT NULL COMMENT '排序索引值',
  `poster_file_name` varchar(100) COLLATE utf8mb4_general_ci NOT NULL COMMENT '海报文件名称',
  `url` varchar(200) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '活动地址',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='广告投放';

-- --------------------------------------------------------

--
-- 表的结构 `article`
--

DROP TABLE IF EXISTS `article`;
CREATE TABLE IF NOT EXISTS `article` (
  `id` bigint NOT NULL COMMENT '文章ID',
  `title` varchar(200) NOT NULL COMMENT '文章标题',
  `description` text COMMENT '文章介绍',
  `tag` varchar(150) NOT NULL COMMENT '文章标签',
  `author` bigint NOT NULL COMMENT '发布者ID',
  `content` mediumtext NOT NULL COMMENT '文章内容',
  `cover_file_name` varchar(60) DEFAULT NULL COMMENT '封面图片名称',
  `reprint` varchar(300) DEFAULT '0' COMMENT '转载地址，原创为null',
  `view_count` int NOT NULL DEFAULT '0' COMMENT '阅读次数',
  `update_time` datetime DEFAULT NULL COMMENT '最近一次更新的时间',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='文章表';

--
-- 转存表中的数据 `article`
--

INSERT INTO `article` (`id`, `title`, `description`, `tag`, `author`, `content`, `cover_file_name`, `reprint`, `view_count`, `update_time`, `create_time`) VALUES
(195783521610, '萨的', '阿萨德', '281634969610,281633270110,281635673010,281637246810', 1, '<p>asd adfadfdfasdfasdsadqweqwsadasd</p>\n<pre><code class=\"language-js\">阿萨德\n</code></pre>\n<pre><code class=\"language-js\">&lt;script&gt;&lt;script/&gt;\n</code></pre>\n', NULL, NULL, 0, '2022-08-04 00:30:01', '2022-07-21 23:50:35'),
(306409230010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:12'),
(306409244910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 1, NULL, '2022-08-03 19:08:12'),
(306409258710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:12'),
(306409276310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:12'),
(306409292710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:12'),
(306409307910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409324310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409342010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409357510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409374310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409391310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:13'),
(306409409310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409426610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409443910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409460910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409477610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409494510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:14'),
(306409510810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409527310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409543410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409562410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409579110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409595210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:15'),
(306409611110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409627210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409643210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409660410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409676910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409692910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:16'),
(306409710110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409727310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409745310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409760810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409777510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409793910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:17'),
(306409811810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306409827710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306409844710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306409861310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306409877710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306409893810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:18'),
(306410506910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410522610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410538510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410555210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410571710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410587810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:25'),
(306410604410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410620510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410636310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410653010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410669910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410685110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:26'),
(306410702610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410718910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410737610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410751010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410766910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410784010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410799510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:27'),
(306410815110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410830510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410846510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410862510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410878710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410893710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:28'),
(306410909910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', '0a2035ea4f0242ed9a6fb7d5f9b134a3.webp', NULL, 1214, NULL, '2022-08-03 19:08:29'),
(306410926710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:29'),
(306410943110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:29'),
(306410958510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:29'),
(306410974510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:29'),
(306410991610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:29'),
(306411007710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411023910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411040610, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411057310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411072410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411091310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:30'),
(306411105710, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411124110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411139110, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411155910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411172010, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411188510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:31'),
(306411205210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411222510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411238510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411255510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411269910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411285910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:32'),
(306411301510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:33'),
(306411319210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:33'),
(306411379910, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:33'),
(306411397210, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:33'),
(306411413510, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:34'),
(306411431310, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:34'),
(306411446410, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:34'),
(306411461810, '123123', '萨顶顶', '281632130010,272809693910,281637246810,281635673010', 1, '<p>萨顶顶多多多多多多多多多答复阿斯顿发生安抚第三方阿萨德阿斯顿发斯蒂芬阿萨德发撒的发的手打阿萨德撒的</p>\n', NULL, NULL, 0, NULL, '2022-08-03 19:08:34'),
(311640296010, '阿斯顿撒多', '大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙', '272809693910,281633270110', 1, '<p>大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙大惊失色所所所所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所军所考虑考虑进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙进口量即可了解快乐健康六角恐龙</p>\n', NULL, 'https://www.npmjs.com/package/react-infinite-scroll-component', 5, NULL, '2022-08-04 09:40:02'),
(398987611810, '阿诗丹顿多多多多多多多', NULL, '281632130010,272809693910,281633270110', 1, '<p>萨顶顶多多多多多多多多多多多多import { FC, useEffect } from \"react\";\nimport { Button, Input, Form, message } from \"antd\";\nimport { useRecoilState } from \"recoil\";\nimport { writeArticleContext } from \"../index\";\nimport Type from \"./Type\";\nimport Cover from \"./Cover\";\nimport Reprint from \"./Reprint\";\nimport type { modalPropsType } from \"../index\";</p>\n<p>const Modal: FC = props =&gt; {\n  let { TextArea } = Input;\n  let { Item, useForm } = Form;\n  let [articleData, setArticleData] = useRecoilState(writeArticleContext);\n  const [form] = useForm();</p>\n<p>  useEffect(() =&gt; {\n    form.setFieldsValue(Object.assign({}, articleData));\n  }, [articleData]);</p>\n<p>  return (\n    </p>\n      \n        发布文章\n      \n      \n        &lt;Form\n          labelCol={{ span: 3, offset: 2 }}\n          className=\"mt-2\"\n          initialValues={articleData}\n          form={form}\n          onFinishFailed={({ errorFields }) =&gt; {\n            if (errorFields.length) {\n              message.warn(errorFields[0].errors[0]);\n            }\n          }}\n          onFinish={props.submit}\n        &gt;\n          &lt;Item\n            name=\"title\"\n            hidden\n            rules={[\n              { required: true, message: \"请填写标题\" },\n              { min: 1, max: 50, message: \"标题字数为1-50\" },\n            ]}\n            children={}\n          /&gt;\n          &lt;Item\n            name=\"content\"\n            hidden\n            rules={[\n              { required: true, message: \"请填写文章内容\" },\n              { min: 20, message: \"内容最少20字符\" },\n            ]}\n            children={}\n          /&gt;\n          &lt;Item\n            label=\"标签\"\n            required\n            name=\"tag\"\n            help={null}\n            rules={[\n              { required: true, message: \"选择文章标签\" },\n              { type: \"array\", min: 1, max: 6, message: \"标签数量为1-6\" },\n            ]}\n          &gt;\n            \n          \n          \n            \n          \n          &lt;Item\n            label=\"文章摘要\"\n            name=\"description\"\n            rules={[{ max: 200, message: \"文章摘要最多200字\" }]}\n          &gt;\n            &lt;TextArea\n              value={articleData.description || \"\"}\n              onChange={e =&gt; setArticleData(_data =&gt; ({ ..._data, description: e.target.value }))}\n              rows={4}\n              placeholder=\"文章简介，最多200字\"\n              maxLength={200}\n              showCount\n              className=\"w-11/12\"\n            /&gt;\n          \n          &lt;Item\n            label=\"转载地址\"\n            name=\"reprint\"\n            rules={[\n              {\n                pattern: /^https://.*/,\n                message: \"转载地址为https协议\",\n              },\n              { min: 1, max: 150, message: \"地址长度为1-150\" },\n            ]}\n          &gt;\n            \n          \n          \n            \n              \n                {props.submitText}\n              \n            \n          \n        \n      \n    \n  );\n};\nexport default Modal;<p></p>\n', NULL, NULL, 1, NULL, '2022-08-14 12:17:56'),
(399618983710, '少时诵诗书所所所所所', NULL, '272809693910,281633270110', 1, '<p>ssssssssssssssssssssssssssssssssssssss</p><p>s&lt;/p少时诵诗书所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所</p><p>s</p>\n少时诵诗书所所所所所所所所所所所所<p></p>\n', NULL, NULL, 0, NULL, '2022-08-14 14:03:09'),
(399619713210, '少时诵诗书所所所所所', NULL, '272809693910,281633270110', 1, '<p>ssssssssssssssssssssssssssssssssssssss</p><p>s&lt;/p少时诵诗书所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所</p><p>s</p>\n少时诵诗书所所所所所所所所所所所所<p></p>\n', NULL, NULL, 0, NULL, '2022-08-14 14:03:17'),
(399619731910, '少时诵诗书所所所所所', NULL, '272809693910,281633270110', 1, '<p>ssssssssssssssssssssssssssssssssssssss</p><p>s&lt;/p少时诵诗书所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所所</p><p>s</p>\n少时诵诗书所所所所所所所所所所所所<p></p>\n', NULL, NULL, 0, NULL, '2022-08-14 14:03:17'),
(402902582210, '鞍山市所所所所所', NULL, '272809693910,281633270110', 1, '<h1>标题</h1>\n<p><a href=\"https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789\">https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789https://juejin.cn/editor/drafts/7130922529815789</a></p>\n', NULL, 'https://juejin.cn/editor/drafts/7130922529815789', 1, NULL, '2022-08-14 23:10:25'),
(411625858510, 'asd', 'sad', '281633270110,281632130010', 1, '<p>import { useState, Fragment } from \"react\";\nimport { Button, InputNumber, Form, Input, Select } from \"antd\";\nimport axios from \"axios\";\nimport Upload from \"@/components/UpLoad\";</p>\n<p>let { Item } = Form;\nconst { Option } = Select;\nconst APP = () =&gt; {\n  function onFinish(values: any) {\n    console.log(values);</p>\n<pre><code>axios.post(\"/advertisement\", values).then(res =&gt; {\n  console.log(res.data);\n});\n</code></pre>\n<p>  }\n  return (\n    &lt;&gt;\n      &lt;Form\n        labelCol={{ span: 2 }}\n        wrapperCol={{ span: 10 }}\n        onFinish={onFinish}\n        autoComplete=\"off\"\n        // initialValues={{ poster_file_name: \"\", indexes: 1, url: null, position: \"all\" }}\n      &gt;\n        &lt;Item\n          label=\"海报\"\n          name=\"poster_file_name\"\n          required\n          // rules={[\n          //   { required: true, message: \"选择海报\" },\n          //   { min: 10, message: \"最小长度为10\" },\n          // ]}\n        &gt;\n          \n        \n        \n          \n        \n        &lt;Item\n          label=\"索引值\"\n          name=\"indexes\"\n          required\n          rules={[\n            { required: true, message: \"请填写索引值\" },\n            { type: \"number\", min: 1, message: \"最小为1\" },\n          ]}\n        &gt;\n          \n        \n        \n          &lt;Select style={{ width: 120 }}&gt;\n            \n            \n            \n          \n        \n        &lt;Item wrapperCol={{ offset: 2, span: 10 }}&gt;\n          \n            发布\n          \n        \n      \n    &lt;/&gt;\n  );\n};\nexport default APP;</p>\n', '98754a904e2040988ae739bbfa5435f5.webp', NULL, 0, NULL, '2022-08-15 23:24:18'),
(411704336110, '测试图片', NULL, '281635673010', 1, '<p>import { useState, Fragment } from \"react\"; import { Button, InputNumber, Form, Input, Select } from \"antd\"; import axios from \"axios\"; import Upload from \"@/components/UpLoad\";</p>\n<p>let { Item } = Form; const { Option } = Select; const APP = () =&gt; { function onFinish(values: any) { console.log(values);</p>\n<pre><code>axios.post(\"/advertisement\", values).then(res =&gt; {\n  console.log(res.data);\n});\n</code></pre>\n<p>} return ( &lt;&gt; &lt;Form labelCol={{ span: 2 }} wrapperCol={{ span: 10 }} onFinish={onFinish} autoComplete=\"off\" initialValues={{ poster_file_name: \"\", indexes: 1, url: null, position: \"all\" }} &gt; &lt;Item label=\"海报\" name=\"poster_file_name\" required // rules={[ // { required: true, message: \"选择海报\" }, // { min: 10, message: \"最小长度为10\" }, // ]} &gt; &lt;Item label=\"索引值\" name=\"indexes\" required rules={[ { required: true, message: \"请填写索引值\" }, { type: \"number\", min: 1, message: \"最小为1\" }, ]} &gt; &lt;Select style={{ width: 120 }}&gt; &lt;Item wrapperCol={{ offset: 2, span: 10 }}&gt; 发布 &lt;/&gt; ); }; export default APP;</p>\n', 'f8603849690c483e89c3343b25b77c74.webp', NULL, 1, '2022-08-15 23:56:27', '2022-08-15 23:37:23');

-- --------------------------------------------------------

--
-- 表的结构 `collection`
--

DROP TABLE IF EXISTS `collection`;
CREATE TABLE IF NOT EXISTS `collection` (
  `id` bigint NOT NULL COMMENT 'ID',
  `article_id` bigint NOT NULL COMMENT '文章ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `time` datetime NOT NULL COMMENT '收藏时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='收藏表';

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

DROP TABLE IF EXISTS `comment`;
CREATE TABLE IF NOT EXISTS `comment` (
  `id` bigint NOT NULL COMMENT 'ID',
  `article_id` bigint NOT NULL COMMENT '文章ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `content` text NOT NULL COMMENT '内容',
  `reply` bigint DEFAULT NULL COMMENT '是否是对某个评论的回复，不是则为null是则为对应的评论id',
  `client_ip` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户IP',
  `comment_pics` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '评论中使用到的图片',
  `create_time` datetime NOT NULL COMMENT '评论时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='评论表';

-- --------------------------------------------------------

--
-- 表的结构 `drafts`
--

DROP TABLE IF EXISTS `drafts`;
CREATE TABLE IF NOT EXISTS `drafts` (
  `id` bigint NOT NULL COMMENT 'ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `title` varchar(200) DEFAULT NULL COMMENT '文章标题',
  `content` mediumtext NOT NULL COMMENT '草稿箱内容',
  `time` datetime NOT NULL COMMENT '添加时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='草稿箱';

--
-- 转存表中的数据 `drafts`
--

INSERT INTO `drafts` (`id`, `user_id`, `title`, `content`, `time`) VALUES
(399614877710, 1, '撒啊啊啊啊啊啊啊', '<p>萨顶顶多多多多多多多多多</p>\n', '2022-08-14 14:02:28'),
(399616676310, 1, '鞍山市所所所所所', '<h1>标题</h1>', '2022-08-14 14:02:46'),
(400496612110, 1, '撒啊啊啊啊啊', '<p>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa<p>s&lt;/p撒啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊<p>s</p></p>\n', '2022-08-14 16:29:26'),
(400501012710, 1, '少时诵诗书所所所所所', '# 啊\r\n', '2022-08-14 16:30:10');

-- --------------------------------------------------------

--
-- 表的结构 `follow`
--

DROP TABLE IF EXISTS `follow`;
CREATE TABLE IF NOT EXISTS `follow` (
  `id` bigint NOT NULL COMMENT 'ID',
  `blogger_id` bigint NOT NULL COMMENT '被关注者的ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `time` datetime NOT NULL COMMENT '关注时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='关注表';

--
-- 转存表中的数据 `follow`
--

INSERT INTO `follow` (`id`, `blogger_id`, `user_id`, `time`) VALUES
(366502051510, 1, 1, '2022-08-10 18:03:40');

-- --------------------------------------------------------

--
-- 表的结构 `notice`
--

DROP TABLE IF EXISTS `notice`;
CREATE TABLE IF NOT EXISTS `notice` (
  `id` bigint NOT NULL COMMENT 'ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `content` mediumtext NOT NULL COMMENT '内容',
  `title` varchar(400) NOT NULL COMMENT '标题',
  `isRead` tinyint(1) NOT NULL COMMENT '已读',
  `time` datetime NOT NULL COMMENT '发送时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='站内提示信息存储';

-- --------------------------------------------------------

--
-- 表的结构 `tag`
--

DROP TABLE IF EXISTS `tag`;
CREATE TABLE IF NOT EXISTS `tag` (
  `id` bigint NOT NULL COMMENT 'ID',
  `name` varchar(100) NOT NULL COMMENT 'tag名称',
  `belong` bigint NOT NULL COMMENT '所属Type的ID',
  `icon_file_name` varchar(255) DEFAULT NULL COMMENT 'ICON文件名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `indexes` int NOT NULL COMMENT '索引值',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `tag`
--

INSERT INTO `tag` (`id`, `name`, `belong`, `icon_file_name`, `create_time`, `indexes`) VALUES
(272809693910, '321', 264563342910, NULL, '2022-07-30 21:48:16', 2),
(281632130010, '阿斯顿发', 264563342910, 'e3fd40fb96ed434eac43e406a5ce2476.webp', '2022-07-31 22:18:41', 0),
(281633270110, '森岛帆高', 264563342910, 'cb8a72d4ac7640bf9b7c5ddb9b7333c5.webp', '2022-07-31 22:18:52', 3),
(281634969610, '阿斯顿发啊', 264563342910, NULL, '2022-07-31 22:19:09', 4),
(281635673010, '森岛帆高第三方个森岛帆高的', 281634314910, NULL, '2022-07-31 22:19:16', 1),
(281637246810, '的双方各第三方地方', 281634314910, 'b49dc32bc4444f7fa7a4747fb2216259.webp', '2022-07-31 22:19:32', 0),
(385626967810, '123123', 385329225510, NULL, '2022-08-12 23:11:09', 1),
(385627505510, '123123123', 385329225510, NULL, '2022-08-12 23:11:15', 2);

-- --------------------------------------------------------

--
-- 表的结构 `tips_set`
--

DROP TABLE IF EXISTS `tips_set`;
CREATE TABLE IF NOT EXISTS `tips_set` (
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `follow` tinyint(1) DEFAULT NULL COMMENT '关注的用户有新文章',
  `comment` tinyint(1) DEFAULT NULL COMMENT '收到回复',
  `follow_me` tinyint(1) DEFAULT NULL COMMENT '有人关注我',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户消息推送设置';

-- --------------------------------------------------------

--
-- 表的结构 `type`
--

DROP TABLE IF EXISTS `type`;
CREATE TABLE IF NOT EXISTS `type` (
  `id` bigint NOT NULL COMMENT 'ID',
  `name` varchar(40) NOT NULL COMMENT '类型/标签 名字',
  `indexes` int NOT NULL COMMENT '排序、索引',
  `icon_file_name` varchar(60) DEFAULT NULL COMMENT 'ICON文件名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `description` text NOT NULL COMMENT '介绍用于meta中description',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='网站文章的类型与标签';

--
-- 转存表中的数据 `type`
--

INSERT INTO `type` (`id`, `name`, `indexes`, `icon_file_name`, `create_time`, `description`) VALUES
(264563342910, '213', 2, NULL, '2022-07-29 22:53:53', 'asdsadasdasdasd'),
(281634314910, '阿斯顿发', 2, '248d7eb026de42c683bb743e34fa148a.webp', '2022-07-31 22:19:03', '阿数据库的话卡卷红烧豆腐框架爱是可点击好'),
(281638090010, '空的', 3, NULL, '2022-07-31 22:19:40', '空的空的空的空的空的空的空的空的空的空的空的'),
(385328797410, '阿斯顿撒多撒', 4, '776ce49bbdbb4abf8e494301c81e1307.webp', '2022-08-12 22:21:27', '阿斯顿撒多撒'),
(385329225510, '阿斯顿发送到', 5, NULL, '2022-08-12 22:21:32', '阿斯顿发斯蒂芬');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `id` bigint NOT NULL COMMENT '用户ID',
  `name` varchar(40) NOT NULL COMMENT '昵称',
  `auth` int NOT NULL COMMENT '身份',
  `email` varchar(60) DEFAULT NULL COMMENT '用户邮箱',
  `github` varchar(40) DEFAULT NULL COMMENT 'GitHub ID',
  `qq` varchar(40) DEFAULT NULL COMMENT 'QQ号',
  `password` varchar(30) NOT NULL COMMENT '密码',
  `state` int NOT NULL DEFAULT '1' COMMENT '状态，（权限）',
  `description` text COMMENT '自我介绍',
  `site` varchar(200) DEFAULT NULL COMMENT '个人网站',
  `unit` varchar(100) DEFAULT NULL COMMENT '所属单位',
  `location` varchar(30) DEFAULT NULL COMMENT '所在地区',
  `avatar_file_name` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '头像图片名称',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `email` (`email`),
  UNIQUE KEY `github` (`github`),
  UNIQUE KEY `qq` (`qq`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户数据表';

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `name`, `auth`, `email`, `github`, `qq`, `password`, `state`, `description`, `site`, `unit`, `location`, `avatar_file_name`, `create_time`) VALUES
(1, 'admin1', 1, '1974109227@qq.com', 'Lrunlin', '1974109227', '1974109227', 1, NULL, NULL, NULL, NULL, 'default.webp', '2022-07-10 00:00:00'),
(247111576410, '1', 0, '353575900@qq.com', NULL, NULL, '11111111', 1, '低调的站长', NULL, NULL, NULL, 'default.webp', '2022-07-27 22:25:15');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
